using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Theme9Pr1
{
    class Program
    {
        //Задание 1.
        //static void Main(string[] args)
        //{
        //    //1. Создать пустой список целого типа.
        //    List<int> ints = new List<int>();
        //    //2. Добавить следующие элементы в коллекцию: 1, 10, 25, 17, 10.
        //    ints.Add(1);
        //    ints.Add(10);
        //    ints.Add(25);
        //    ints.Add(17);
        //    ints.Add(10);
        //    //3. Через дополнительный метод просмотреть содержимое списка.
        //    Output(ints);
        //    //4. Определить количество элементов списка
        //    Console.WriteLine($"Count = {ints.Count}");
        //    //5. Определить индекс элемента со значением, равным 25.
        //    Console.WriteLine($"Индекс 25: = {ints.IndexOf(25)}");
        //    //6.Удалить из списка первый элемент со значением 10 и через дополнительный метод просмотреть содержимое списка.
        //    ints.RemoveAt(1);//Удаляет 10
        //    Output(ints);
        //    Console.WriteLine();
        //    //7. Удалить из списка элемент с индексом, равным 2 и через дополнительный метод просмотреть содержимое списка.
        //    ints.RemoveAt(2);//Удаляет 17
        //    Output(ints);
        //    //8. Проверить наличие элемента со значением 25 в списке.
        //    bool x = ints.Contains(25);
        //    Console.WriteLine($"Индекс 25 = {x}");
        //    //9.Вставить число 500 в самом начале списка и через дополнительный метод просмотреть содержимое списка.
        //    ints.Insert(0, 500);
        //    Output(ints);
        //    Console.WriteLine();
        //    //10. Отсортировать элементы списка по возрастанию и через дополнительный метод просмотреть содержимое списка.
        //    ints.Sort();
        //    Output(ints);
        //    Console.WriteLine();
        //    //11. Изменить значение нулевого элемента списка на величину, равную сумме первого элемента и числа
        //    ints.Insert(0, ints[1] + 3);
        //    Output(ints);
        //    Console.ReadKey();
        //}

        //static void Output(List<int> ints)
        //{
        //    foreach (var elem in ints)
        //    {

        //        Console.WriteLine(elem);
        //    }
        //}
        //Задание  2. Удалить все нечетные элементы списка, заполненного случайным образом целыми числами.
        //static void Main()
        //{
        //    Random rnd = new Random();
        //    List<int> ints = new List<int>();
        //    for (int i = 0; i < 10; i++)
        //    {
        //        ints.Add(rnd.Next(-100,100));
        //    }
        //    Compare(ints);
        //    Output(ints);
        //    Console.ReadKey();
        //}
        //static void Compare(List<int> ints)
        //{
        //    for (int i = 0; i < ints.Count; i++)
        //    {
        //        if ((ints[i]) % 2 != 0)
        //        {
        //            ints.RemoveAt(i);
        //            i--;
        //        }
        //    }
        //}
        //static void Output(List<int> ints)
        //{
        //    foreach (var elem in ints)
        //    {

        //        Console.WriteLine(elem);
        //    }
        //}
        //Задание 3. Записана информация о стоимости каждого из 20 видов товара, продаваемых фирмой. С 1 января очередного года фирма прекращает продавать товар, стоимость которого записана в n-м элементе списка. Получить список со стоимостью всех оставшихся видов товара.
     
        }


    }
}

