using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Theme7Pr1
{
    class Program
    {
        static void Main(string[] args)
        {
            //Задача 1. Соответствие номера из таблицы Unicode символу
            //for (int i = 0; i < 256; i++)
            //Console.WriteLine($"Код {i} соответствует символу  {(char)i}");
            //Console.ReadKey();

            //Задача 2. Дан символ. Вывести его код
            //Console.Write("Введите символ ");
            //char ch = char.Parse(Console.ReadLine());
            //Console.WriteLine($"Символ {ch} имеет код {(int)ch}");
            //Console.ReadKey();

            //Задача 3. Дан символ. Вывести символ, который в кодовой таблице ASCII следует за этим символом
            //Console.Write("Введите символ ");
            //char ch = char.Parse(Console.ReadLine());
            //Console.WriteLine($"Символ {(char)((int)ch+1)}");
            //Console.ReadKey();

            //Задача 4. Дан символ. Вывести два символа, стоящие перед ним в кодовой таблице ASCII
            //Console.Write("Введите символ ");
            //char ch = char.Parse(Console.ReadLine());
            //Console.WriteLine($"Символ {(char)((int)ch - 1)}\n Символ {(char)((int)ch - 2)}");
            //Console.ReadKey();
            //Задача 5.Дан символ.Вывести два символа, первый из которых предшествует введенному символу в кодовой таблице, а второй – следует после него
            //Console.Write("Введите символ ");
            //char ch = char.Parse(Console.ReadLine());
            //Console.WriteLine($"Символ {(char)((int)ch - 1)}\n Символ {(char)((int)ch + 1)}");
            //Console.ReadKey();

            //Задача 6. Дано название футбольного клуба. Напечатать его на экране «столбиком»
            //Console.Write("Введите название клуба ");
            //string ch = Console.ReadLine();
            //char[] omas = ch.ToCharArray();
            //for (int i = 0; i < omas.Length; i++)
            //{
            //    Console.WriteLine($"omas[{i}] = {omas[i]} ");
            //}

            //6.2
            //string ch = Console.ReadLine();
            //char[] omas = ch.ToCharArray();
            //foreach (char elem in omas)
            //{
            //    Console.WriteLine($"{elem}");
            //}
            //Console.ReadKey();

            //Задача 7. Составить программу, которая печатает заданное слово, начиная с последней буквы
            //Console.Write("Введите слово ");
            //string ch = Console.ReadLine();
            //char[] omas = ch.ToCharArray();
            //for (int i = omas.Length - 1; i>= 0;i--)
            //{ Console.WriteLine($"{omas[i]}"); }
            //Console.ReadKey();

            //Задача 8. Преобразовать символы в строке из строчных в прописные и обратно
            //Console.Write("Введите строку ");
            //string ch = Console.ReadLine();
            //char[] a = ch.ToCharArray();
            //for (int i = 0; i < a.Length; i++)
            //{
            //    Console.Write(char.ToUpper(a[i]));
            //}
            //Console.WriteLine();
            //for (int i = 0; i < a.Length; i++)
            //{
            //    Console.Write(char.ToLower(a[i]));
            //}
            //Console.ReadKey();


            Console.ReadKey();
        }
    }
}
